; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v3)
		(pred_6 ?v6)
		(pred_1 ?v2)
		(pred_2 ?v2)
		(pred_4 ?v6 ?v2)
		(pred_5)
		(pred_3 ?v6))

   (:action op_3
       :parameters  (?v5 ?v4)
       :precondition (and (not-eq ?v5 ?v4) 
                          (pred_1 ?v5) (pred_1 ?v4) (pred_2 ?v5))
       :effect (and  (pred_2 ?v4)
		     (not (pred_2 ?v5))))


   (:action op_2
       :parameters (?v7 ?v1)
       :precondition  (and  (pred_6 ?v7) (pred_1 ?v1)
			    (pred_4 ?v7 ?v1) (pred_2 ?v1) (pred_5))
       :effect (and (pred_3 ?v7)
		    (not (pred_4 ?v7 ?v1)) 
		    (not (pred_5))))

   (:action op_1
       :parameters  (?v7  ?v1)
       :precondition  (and  (pred_6 ?v7) (pred_1 ?v1)
			    (pred_3 ?v7) (pred_2 ?v1))
       :effect (and (pred_4 ?v7 ?v1)
		    (pred_5)
		    (not (pred_3 ?v7)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_04 obj_01 obj_06 obj_02 
          obj_03 obj_05 
)
(:init
(pred_1 obj_04)
(pred_1 obj_01)
(pred_1 obj_06)
(pred_1 obj_02)
(pred_6 obj_03)
(pred_6 obj_05)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(pred_5)
(pred_4 obj_03 obj_01)
(pred_4 obj_05 obj_02)
(pred_2 obj_01)
)
(:goal
(and
(pred_4 obj_03 obj_04)
(pred_4 obj_05 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_4 obj_03 obj_04) (pred_2 obj_06))
    (sometime-before  (pred_4 obj_05 obj_06) (pred_2 obj_04))
  )
)
)

; plan
1. (op_2 obj_03 obj_01)
   deleted: (pred_4 obj_03 obj_01) (pred_5)
   added: (pred_3 obj_03)
   goals met: 0 of 2
2. (op_3 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_06)
   goals met: 0 of 2
3. (op_3 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 0 of 2
4. (op_1 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_4 obj_03 obj_04) (pred_5)
   goals met: 1 of 2
5. (op_3 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 1 of 2
6. (op_2 obj_05 obj_02)
   deleted: (pred_4 obj_05 obj_02) (pred_5)
   added: (pred_3 obj_05)
   goals met: 1 of 2
7. (op_3 obj_02 obj_06)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_06)
   goals met: 1 of 2
8. (op_1 obj_05 obj_06)
   deleted: (pred_3 obj_05)
   added: (pred_4 obj_05 obj_06) (pred_5)
   goals met: 2 of 2
